#include "bsp.h"

uint8 dis[6];					//显示数字(-511至512)的字符数组
int	dis_data;					//变量
//********************************************************************************
//整数转字符串  配合串口发送
//********************************************************************************
void lcd_printf(uint8 *s,int temp_data)
{
	if(temp_data<0)
	{
		temp_data=-temp_data;
		*s='-';
	}
	else *s=' ';

	*++s =temp_data/10000+0x30;
	temp_data=temp_data%10000;     //取余运算

	*++s =temp_data/1000+0x30;
	temp_data=temp_data%1000;     //取余运算

	*++s =temp_data/100+0x30;
	temp_data=temp_data%100;     //取余运算
	*++s =temp_data/10+0x30;
	temp_data=temp_data%10;      //取余运算
	*++s =temp_data+0x30; 	
}
//*************************************************************************************************
//I2C起始信号
//*************************************************************************************************
void I2C_Start()
{
    SDA = 1;                    //拉高数据线
    SCL = 1;                    //拉高时钟线
    Delay5us();                 //延时
    SDA = 0;                    //产生下降沿
    Delay5us();                 //延时
    SCL = 0;                    //拉低时钟线
}
//*************************************************************************************************
//I2C停止信号
//*************************************************************************************************
void I2C_Stop()
{
    SDA = 0;                    //拉低数据线
		SCL = 0;
		Delay5us();
    SCL = 1;                    //拉高时钟线
    Delay5us();                 //延时
    SDA = 1;                    //产生上升沿
    //Delay5us();                 //延时
}
//**************************************************************************************************
//I2C发送应答信号
//入口参数:ack (0:ACK 1:NAK)
//**************************************************************************************************
void I2C_SendACK(bit ack)
{
    SDA = ack;                  //写应答信号
    SCL = 1;                    //拉高时钟线
    Delay5us();                 //延时
    SCL = 0;                    //拉低时钟线
    Delay5us();                 //延时
}
//****************************************************************************************************
//I2C接收应答信号
//****************************************************************************************************
bit I2C_RecvACK()
{
    SCL = 1;                    //拉高时钟线
    Delay5us();                 //延时
    CY = SDA;                   //读应答信号
    SCL = 0;                    //拉低时钟线
    Delay5us();                 //延时
    return CY;
}
//*****************************************************************************************************
//向I2C总线发送一个字节数据
//*****************************************************************************************************
void I2C_SendByte(uint8 dat)
{
    uint8 i;
    for (i=0; i<8; i++)         //8位计数器
    {
        dat <<= 1;              //移出数据的最高位
        SDA = CY;               //送数据口
        SCL = 1;                //拉高时钟线
        Delay5us();             //延时
        SCL = 0;                //拉低时钟线
        Delay5us();             //延时
    }
    I2C_RecvACK();
}
//*****************************************************************************************************
//从I2C总线接收一个字节数据
//******************************************************************************************************
uint8 I2C_RecvByte()
{
    uint8 i;
    uint8 dat = 0;
    SDA = 1;                    //使能内部上拉,准备读取数据,
    for (i=0; i<8; i++)         //8位计数器
    {
        dat <<= 1;
        SCL = 1;                //拉高时钟线
        Delay5us();             //延时
        dat |= SDA;             //读数据               
        SCL = 0;                //拉低时钟线
        Delay5us();             //延时
    }
    return dat;
}


/*******************************************************************************
* 函数名	: WriteRegfdc2214 
* 描述	    : 写寄存器数据
* 输入参数  : add，value
* 返回参数  : 无
*******************************************************************************/
void WriteRegfdc2214(unsigned char add,unsigned int value)
{
    I2C_Start(); 
    I2C_SendByte(0X54);	 //ADDR=0时，地址0X2A<<1+0=0X54  
    I2C_SendByte(add);      //写地址
    I2C_SendByte(value>>8); //
    I2C_SendByte(value&0xff);//写低8位
    I2C_Stop();               //产生一个停止条件 
    delay_ms(10);	 
}
/*******************************************************************************
* 函数名	: ReadRegLDC 
* 描述	    : 读寄存器数据
* 输入参数  : add地址
* 返回参数  : 无
*******************************************************************************/
unsigned int ReadRegfdc2214(unsigned char add)
{
    unsigned int status;
    unsigned int a,b;
    I2C_Start(); 
    I2C_SendByte(0X54);	   //写命令ADDR=0
    I2C_SendByte(add);     //
    I2C_Start();            //重新开始
    I2C_SendByte(0X55);	   //发送读命令ADDR=0
    
    a=I2C_RecvByte();     //读高位
	I2C_SendACK(0); 
    b=I2C_RecvByte();		 //读低位
	I2C_SendACK(1); 
    status=(a<<8)+b;
    I2C_Stop();
    return (status);
}
/*******************************************************************************
* 函数名	: InitSingleLDC1314 
* 描述	    : 初始化单通道
* 输入参数  : 无
* 返回参数  : 无
*******************************************************************************/
void InitSinglefdc2214(void)
{
    WriteRegfdc2214(0x08,0x34FB);
		WriteRegfdc2214(0x09,0x34FB);
		WriteRegfdc2214(0x0A,0x34FB);
		WriteRegfdc2214(0x0B,0x34FB);//设置转换时间  设置达到最高精度
	
    WriteRegfdc2214(0x10,0x001B);
		WriteRegfdc2214(0x11,0x001B);
		WriteRegfdc2214(0x12,0x001B);
		WriteRegfdc2214(0x13,0x001B);//FDC2214_SETTLECOUNT_CH0~3 计数

    WriteRegfdc2214(0x14,0x2002); 
		WriteRegfdc2214(0x15,0x2002);
		WriteRegfdc2214(0x16,0x2002);
		WriteRegfdc2214(0x17,0x2002);//分频洗系数

    WriteRegfdc2214(0x19,0x0000); //ERROE_CONFIG
	
    WriteRegfdc2214(0x1B,0xC20D); //通道配置
	
    WriteRegfdc2214(0x1E,0x7800); 
		WriteRegfdc2214(0x1F,0x7800);
		WriteRegfdc2214(0x20,0x7800);
		WriteRegfdc2214(0x21,0x7800);//配置驱动电流
		
		WriteRegfdc2214(0x1A,0x1401);//配置寄存器
}
